SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32BG24/Include/efr32bg24_modem.h
/* Bit fields for MODEM CHFCOE11 */
#define _MODEM_CHFCOE11_RESETVALUE                              0x00000000UL                               /**< Default value for MODEM_CHFCOE11            */
#define _MODEM_CHFCOE11_MASK                                    0x003FFFFFUL                               /**< Mask for MODEM_CHFCOE11                     */
#define _MODEM_CHFCOE11_SET1COEFF3_SHIFT                        0                                          /**< Shift value for MODEM_SET1COEFF3            */
#define _MODEM_CHFCOE11_SET1COEFF3_MASK                         0x7FFUL                                    /**< Bit mask for MODEM_SET1COEFF3               */
#define _MODEM_CHFCOE11_SET1COEFF3_DEFAULT                      0x00000000UL                               /**< Mode DEFAULT for MODEM_CHFCOE11             */
#define MODEM_CHFCOE11_SET1COEFF3_DEFAULT                       (_MODEM_CHFCOE11_SET1COEFF3_DEFAULT << 0)  /**< Shifted mode DEFAULT for MODEM_CHFCOE11     */
#define _MODEM_CHFCOE11_SET1COEFF4_SHIFT                        11                                         /**< Shift value for MODEM_SET1COEFF4            */
#define _MODEM_CHFCOE11_SET1COEFF4_MASK                         0x3FF800UL                                 /**< Bit mask for MODEM_SET1COEFF4               */
#define _MODEM_CHFCOE11_SET1COEFF4_DEFAULT                      0x00000000UL                               /**< Mode DEFAULT for MODEM_CHFCOE11             */
#define MODEM_CHFCOE11_SET1COEFF4_DEFAULT                       (_MODEM_CHFCOE11_SET1COEFF4_DEFAULT << 11) /**< Shifted mode DEFAULT for MODEM_CHFCOE11     */

/* Bit fields for MODEM CHFCOE12 */
#define _MODEM_CHFCOE12_RESETVALUE                              0x00000000UL                               /**< Default value for MODEM_CHFCOE12            */
#define _MODEM_CHFCOE12_MASK                                    0x007FFFFFUL                               /**< Mask for MODEM_CHFCOE12                     */
#define _MODEM_CHFCOE12_SET1COEFF5_SHIFT                        0                                          /**< Shift value for MODEM_SET1COEFF5            */
#define _MODEM_CHFCOE12_SET1COEFF5_MASK                         0x7FFUL                                    /**< Bit mask for MODEM_SET1COEFF5               */
#define _MODEM_CHFCOE12_SET1COEFF5_DEFAULT                      0x00000000UL                               /**< Mode DEFAULT for MODEM_CHFCOE12             */
#define MODEM_CHFCOE12_SET1COEFF5_DEFAULT                       (_MODEM_CHFCOE12_SET1COEFF5_DEFAULT << 0)  /**< Shifted mode DEFAULT for MODEM_CHFCOE12     */
#define _MODEM_CHFCOE12_SET1COEFF6_SHIFT                        11                                         /**< Shift value for MODEM_SET1COEFF6            */
#define _MODEM_CHFCOE12_SET1COEFF6_MASK                         0x7FF800UL                                 /**< Bit mask for MODEM_SET1COEFF6               */
#define _MODEM_CHFCOE12_SET1COEFF6_DEFAULT                      0x00000000UL                               /**< Mode DEFAULT for MODEM_CHFCOE12             */
#define MODEM_CHFCOE12_SET1COEFF6_DEFAULT                       (_MODEM_CHFCOE12_SET1COEFF6_DEFAULT << 11) /**< Shifted mode DEFAULT for MODEM_CHFCOE12     */

/* Bit fields for MODEM CHFCOE13 */
#define _MODEM_CHFCOE13_RESETVALUE                              0x00000000UL                               /**< Default value for MODEM_CHFCOE13            */
#define _MODEM_CHFCOE13_MASK                                    0x00FFFFFFUL                               /**< Mask for MODEM_CHFCOE13                     */
#define _MODEM_CHFCOE13_SET1COEFF7_SHIFT                        0                                          /**< Shift value for MODEM_SET1COEFF7            */
#define _MODEM_CHFCOE13_SET1COEFF7_MASK                         0xFFFUL                                    /**< Bit mask for MODEM_SET1COEFF7               */
#define _MODEM_CHFCOE13_SET1COEFF7_DEFAULT                      0x00000000UL                               /**< Mode DEFAULT for MODEM_CHFCOE13             */
#define MODEM_CHFCOE13_SET1COEFF7_DEFAULT                       (_MODEM_CHFCOE13_SET1COEFF7_DEFAULT << 0)  /**< Shifted mode DEFAULT for MODEM_CHFCOE13     */
#define _MODEM_CHFCOE13_SET1COEFF8_SHIFT                        12                                         /**< Shift value for MODEM_SET1COEFF8            */
#define _MODEM_CHFCOE13_SET1COEFF8_MASK                         0xFFF000UL                                 /**< Bit mask for MODEM_SET1COEFF8               */
#define _MODEM_CHFCOE13_SET1COEFF8_DEFAULT                      0x00000000UL                               /**< Mode DEFAULT for MODEM_CHFCOE13             */
#define MODEM_CHFCOE13_SET1COEFF8_DEFAULT                       (_MODEM_CHFCOE13_SET1COEFF8_DEFAULT << 12) /**< Shifted mode DEFAULT for MODEM_CHFCOE13     */

/* Bit fields for MODEM CHFCOE14 */
#define _MODEM_CHFCOE14_RESETVALUE                              0x00000000UL                                /**< Default value for MODEM_CHFCOE14            */
#define _MODEM_CHFCOE14_MASK                                    0x0FFFFFFFUL                                /**< Mask for MODEM_CHFCOE14                     */
#define _MODEM_CHFCOE14_SET1COEFF9_SHIFT                        0                                           /**< Shift value for MODEM_SET1COEFF9            */
#define _MODEM_CHFCOE14_SET1COEFF9_MASK                         0x3FFFUL                                    /**< Bit mask for MODEM_SET1COEFF9               */
#define _MODEM_CHFCOE14_SET1COEFF9_DEFAULT                      0x00000000UL                                /**< Mode DEFAULT for MODEM_CHFCOE14             */
#define MODEM_CHFCOE14_SET1COEFF9_DEFAULT                       (_MODEM_CHFCOE14_SET1COEFF9_DEFAULT << 0)   /**< Shifted mode DEFAULT for MODEM_CHFCOE14     */
#define _MODEM_CHFCOE14_SET1COEFF10_SHIFT                       14                                          /**< Shift value for MODEM_SET1COEFF10           */
#define _MODEM_CHFCOE14_SET1COEFF10_MASK                        0xFFFC000UL                                 /**< Bit mask for MODEM_SET1COEFF10              */
#define _MODEM_CHFCOE14_SET1COEFF10_DEFAULT                     0x00000000UL                                /**< Mode DEFAULT for MODEM_CHFCOE14             */
#define MODEM_CHFCOE14_SET1COEFF10_DEFAULT                      (_MODEM_CHFCOE14_SET1COEFF10_DEFAULT << 14) /**< Shifted mode DEFAULT for MODEM_CHFCOE14     */

/* Bit fields for MODEM CHFCOE15 */
#define _MODEM_CHFCOE15_RESETVALUE                              0x00000000UL                                /**< Default value for MODEM_CHFCOE15            */
#define _MODEM_CHFCOE15_MASK                                    0x3FFFFFFFUL                                /**< Mask for MODEM_CHFCOE15                     */
#define _MODEM_CHFCOE15_SET1COEFF11_SHIFT                       0                                           /**< Shift value for MODEM_SET1COEFF11           */
#define _MODEM_CHFCOE15_SET1COEFF11_MASK                        0x3FFFUL                                    /**< Bit mask for MODEM_SET1COEFF11              */
#define _MODEM_CHFCOE15_SET1COEFF11_DEFAULT                     0x00000000UL                                /**< Mode DEFAULT for MODEM_CHFCOE15             */
#define MODEM_CHFCOE15_SET1COEFF11_DEFAULT                      (_MODEM_CHFCOE15_SET1COEFF11_DEFAULT << 0)  /**< Shifted mode DEFAULT for MODEM_CHFCOE15     */
#define _MODEM_CHFCOE15_SET1COEFF12_SHIFT                       14                                          /**< Shift value for MODEM_SET1COEFF12           */
#define _MODEM_CHFCOE15_SET1COEFF12_MASK                        0x3FFFC000UL                                /**< Bit mask for MODEM_SET1COEFF12              */
#define _MODEM_CHFCOE15_SET1COEFF12_DEFAULT                     0x00000000UL                                /**< Mode DEFAULT for MODEM_CHFCOE15             */
#define MODEM_CHFCOE15_SET1COEFF12_DEFAULT                      (_MODEM_CHFCOE15_SET1COEFF12_DEFAULT << 14) /**< Shifted mode DEFAULT for MODEM_CHFCOE15     */

/* Bit fields for MODEM CHFCOE16 */
#define _MODEM_CHFCOE16_RESETVALUE                              0x00000000UL                                /**< Default value for MODEM_CHFCOE16            */
#define _MODEM_CHFCOE16_MASK                                    0xFFFFFFFFUL                                /**< Mask for MODEM_CHFCOE16                     */
#define _MODEM_CHFCOE16_SET1COEFF13_SHIFT                       0                                           /**< Shift value for MODEM_SET1COEFF13           */
#define _MODEM_CHFCOE16_SET1COEFF13_MASK                        0xFFFFUL                                    /**< Bit mask for MODEM_SET1COEFF13              */
#define _MODEM_CHFCOE16_SET1COEFF13_DEFAULT                     0x00000000UL                                /**< Mode DEFAULT for MODEM_CHFCOE16             */
#define MODEM_CHFCOE16_SET1COEFF13_DEFAULT                      (_MODEM_CHFCOE16_SET1COEFF13_DEFAULT << 0)  /**< Shifted mode DEFAULT for MODEM_CHFCOE16     */
#define _MODEM_CHFCOE16_SET1COEFF14_SHIFT                       16                                          /**< Shift value for MODEM_SET1COEFF14           */
#define _MODEM_CHFCOE16_SET1COEFF14_MASK                        0xFFFF0000UL                                /**< Bit mask for MODEM_SET1COEFF14              */
#define _MODEM_CHFCOE16_SET1COEFF14_DEFAULT                     0x00000000UL                                /**< Mode DEFAULT for MODEM_CHFCOE16             */
#define MODEM_CHFCOE16_SET1COEFF14_DEFAULT                      (_MODEM_CHFCOE16_SET1COEFF14_DEFAULT << 16) /**< Shifted mode DEFAULT for MODEM_CHFCOE16     */

/* Bit fields for MODEM CHFCTRL */
#define _MODEM_CHFCTRL_RESETVALUE                               0x00000000UL                              /**< Default value for MODEM_CHFCTRL             */
#define _MODEM_CHFCTRL_MASK                                     0xB0000003UL                              /**< Mask for MODEM_CHFCTRL                      */
#define MODEM_CHFCTRL_FWSWCOEFFEN                               (0x1UL << 0)                              /**< FW Switch CHF COE. Enable                   */
#define _MODEM_CHFCTRL_FWSWCOEFFEN_SHIFT                        0                                         /**< Shift value for MODEM_FWSWCOEFFEN           */
#define _MODEM_CHFCTRL_FWSWCOEFFEN_MASK                         0x1UL                                     /**< Bit mask for MODEM_FWSWCOEFFEN              */
#define _MODEM_CHFCTRL_FWSWCOEFFEN_DEFAULT                      0x00000000UL                              /**< Mode DEFAULT for MODEM_CHFCTRL              */
#define MODEM_CHFCTRL_FWSWCOEFFEN_DEFAULT                       (_MODEM_CHFCTRL_FWSWCOEFFEN_DEFAULT << 0) /**< Shifted mode DEFAULT for MODEM_CHFCTRL      */
#define MODEM_CHFCTRL_FWSELCOEFF                                (0x1UL << 1)                              /**< FW Select CHF COE. set                      */
#define _MODEM_CHFCTRL_FWSELCOEFF_SHIFT                         1                                         /**< Shift value for MODEM_FWSELCOEFF            */
#define _MODEM_CHFCTRL_FWSELCOEFF_MASK                          0x2UL                                     /**< Bit mask for MODEM_FWSELCOEFF               */
#define _MODEM_CHFCTRL_FWSELCOEFF_DEFAULT                       0x00000000UL                              /**< Mode DEFAULT for MODEM_CHFCTRL              */
#define MODEM_CHFCTRL_FWSELCOEFF_DEFAULT                        (_MODEM_CHFCTRL_FWSELCOEFF_DEFAULT << 1)  /**< Shifted mode DEFAULT for MODEM_CHFCTRL      */
#define _MODEM_CHFCTRL_CHFSWSEL_SHIFT                           28                                        /**< Shift value for MODEM_CHFSWSEL              */
#define _MODEM_CHFCTRL_CHFSWSEL_MASK                            0x30000000UL                              /**< Bit mask for MODEM_CHFSWSEL                 */
#define _MODEM_CHFCTRL_CHFSWSEL_DEFAULT                         0x00000000UL                              /**< Mode DEFAULT for MODEM_CHFCTRL              */
#define _MODEM_CHFCTRL_CHFSWSEL_PREDET                          0x00000000UL                              /**< Mode PREDET for MODEM_CHFCTRL               */
#define _MODEM_CHFCTRL_CHFSWSEL_FRC_SUP                         0x00000001UL                              /**< Mode FRC_SUP for MODEM_CHFCTRL              */
#define _MODEM_CHFCTRL_CHFSWSEL_CHFSWTRIG                       0x00000002UL                              /**< Mode CHFSWTRIG for MODEM_CHFCTRL            */
#define _MODEM_CHFCTRL_CHFSWSEL_INVALID                         0x00000003UL                              /**< Mode INVALID for MODEM_CHFCTRL              */
#define MODEM_CHFCTRL_CHFSWSEL_DEFAULT                          (_MODEM_CHFCTRL_CHFSWSEL_DEFAULT << 28)   /**< Shifted mode DEFAULT for MODEM_CHFCTRL      */
#define MODEM_CHFCTRL_CHFSWSEL_PREDET                           (_MODEM_CHFCTRL_CHFSWSEL_PREDET << 28)    /**< Shifted mode PREDET for MODEM_CHFCTRL       */
#define MODEM_CHFCTRL_CHFSWSEL_FRC_SUP                          (_MODEM_CHFCTRL_CHFSWSEL_FRC_SUP << 28)   /**< Shifted mode FRC_SUP for MODEM_CHFCTRL      */
#define MODEM_CHFCTRL_CHFSWSEL_CHFSWTRIG                        (_MODEM_CHFCTRL_CHFSWSEL_CHFSWTRIG << 28) /**< Shifted mode CHFSWTRIG for MODEM_CHFCTRL    */
#define MODEM_CHFCTRL_CHFSWSEL_INVALID                          (_MODEM_CHFCTRL_CHFSWSEL_INVALID << 28)   /**< Shifted mode INVALID for MODEM_CHFCTRL      */
#define MODEM_CHFCTRL_SWCOEFFEN                                 (0x1UL << 31)                             /**< Switch CHF COE. Enable                      */
#define _MODEM_CHFCTRL_SWCOEFFEN_SHIFT                          31                                        /**< Shift value for MODEM_SWCOEFFEN             */
#define _MODEM_CHFCTRL_SWCOEFFEN_MASK                           0x80000000UL                              /**< Bit mask for MODEM_SWCOEFFEN                */
#define _MODEM_CHFCTRL_SWCOEFFEN_DEFAULT                        0x00000000UL                              /**< Mode DEFAULT for MODEM_CHFCTRL              */
#define MODEM_CHFCTRL_SWCOEFFEN_DEFAULT                         (_MODEM_CHFCTRL_SWCOEFFEN_DEFAULT << 31)  /**< Shifted mode DEFAULT for MODEM_CHFCTRL      */

/* Bit fields for MODEM CHFLATENCYCTRL */
#define _MODEM_CHFLATENCYCTRL_RESETVALUE                        0x00000000UL                                    /**< Default value for MODEM_CHFLATENCYCTRL      */
#define _MODEM_CHFLATENCYCTRL_MASK                              0x00000003UL                                    /**< Mask for MODEM_CHFLATENCYCTRL               */
#define _MODEM_CHFLATENCYCTRL_CHFLATENCY_SHIFT                  0                                               /**< Shift value for MODEM_CHFLATENCY            */
#define _MODEM_CHFLATENCYCTRL_CHFLATENCY_MASK                   0x3UL                                           /**< Bit mask for MODEM_CHFLATENCY               */
#define _MODEM_CHFLATENCYCTRL_CHFLATENCY_DEFAULT                0x00000000UL                                    /**< Mode DEFAULT for MODEM_CHFLATENCYCTRL       */
#define MODEM_CHFLATENCYCTRL_CHFLATENCY_DEFAULT                 (_MODEM_CHFLATENCYCTRL_CHFLATENCY_DEFAULT << 0) /**< Shifted mode DEFAULT for MODEM_CHFLATENCYCTRL*/

/* Bit fields for MODEM FRMSCHTIME */
#define _MODEM_FRMSCHTIME_RESETVALUE                            0x00000040UL                                   /**< Default value for MODEM_FRMSCHTIME          */
#define _MODEM_FRMSCHTIME_MASK                                  0xE000FFFFUL                                   /**< Mask for MODEM_FRMSCHTIME                   */
#define _MODEM_FRMSCHTIME_FRMSCHTIME_SHIFT                      0                                              /**< Shift value for MODEM_FRMSCHTIME            */
#define _MODEM_FRMSCHTIME_FRMSCHTIME_MASK                       0xFFFFUL                                       /**< Bit mask for MODEM_FRMSCHTIME               */
#define _MODEM_FRMSCHTIME_FRMSCHTIME_DEFAULT                    0x00000040UL                                   /**< Mode DEFAULT for MODEM_FRMSCHTIME           */
#define MODEM_FRMSCHTIME_FRMSCHTIME_DEFAULT                     (_MODEM_FRMSCHTIME_FRMSCHTIME_DEFAULT << 0)    /**< Shifted mode DEFAULT for MODEM_FRMSCHTIME   */
#define MODEM_FRMSCHTIME_PMRSTSYCNEN                            (0x1UL << 29)                                  /**< ENABLE CLEAN SYNC                           */
#define _MODEM_FRMSCHTIME_PMRSTSYCNEN_SHIFT                     29                                             /**< Shift value for MODEM_PMRSTSYCNEN           */
#define _MODEM_FRMSCHTIME_PMRSTSYCNEN_MASK                      0x20000000UL                                   /**< Bit mask for MODEM_PMRSTSYCNEN              */
#define _MODEM_FRMSCHTIME_PMRSTSYCNEN_DEFAULT                   0x00000000UL                                   /**< Mode DEFAULT for MODEM_FRMSCHTIME           */
#define MODEM_FRMSCHTIME_PMRSTSYCNEN_DEFAULT                    (_MODEM_FRMSCHTIME_PMRSTSYCNEN_DEFAULT << 29)  /**< Shifted mode DEFAULT for MODEM_FRMSCHTIME   */
#define MODEM_FRMSCHTIME_DSARSTSYCNEN                           (0x1UL << 30)                                  /**< ENABLE CLEAN SYNC                           */
#define _MODEM_FRMSCHTIME_DSARSTSYCNEN_SHIFT                    30                                             /**< Shift value for MODEM_DSARSTSYCNEN          */
#define _MODEM_FRMSCHTIME_DSARSTSYCNEN_MASK                     0x40000000UL                                   /**< Bit mask for MODEM_DSARSTSYCNEN             */
#define _MODEM_FRMSCHTIME_DSARSTSYCNEN_DEFAULT                  0x00000000UL                                   /**< Mode DEFAULT for MODEM_FRMSCHTIME           */
#define MODEM_FRMSCHTIME_DSARSTSYCNEN_DEFAULT                   (_MODEM_FRMSCHTIME_DSARSTSYCNEN_DEFAULT << 30) /**< Shifted mode DEFAULT for MODEM_FRMSCHTIME   */
#define MODEM_FRMSCHTIME_PMENDSCHEN                             (0x1UL << 31)                                  /**< EnABLE SCH PM END                           */
#define _MODEM_FRMSCHTIME_PMENDSCHEN_SHIFT                      31                                             /**< Shift value for MODEM_PMENDSCHEN            */
#define _MODEM_FRMSCHTIME_PMENDSCHEN_MASK                       0x80000000UL                                   /**< Bit mask for MODEM_PMENDSCHEN               */
#define _MODEM_FRMSCHTIME_PMENDSCHEN_DEFAULT                    0x00000000UL                                   /**< Mode DEFAULT for MODEM_FRMSCHTIME           */
#define MODEM_FRMSCHTIME_PMENDSCHEN_DEFAULT                     (_MODEM_FRMSCHTIME_PMENDSCHEN_DEFAULT << 31)   /**< Shifted mode DEFAULT for MODEM_FRMSCHTIME   */

/* Bit fields for MODEM PREFILTCOEFF */
#define _MODEM_PREFILTCOEFF_RESETVALUE                          0x3B3B3B3BUL                                    /**< Default value for MODEM_PREFILTCOEFF        */
#define _MODEM_PREFILTCOEFF_MASK                                0xFFFFFFFFUL                                    /**< Mask for MODEM_PREFILTCOEFF                 */
#define _MODEM_PREFILTCOEFF_PREFILTCOEFF_SHIFT                  0                                               /**< Shift value for MODEM_PREFILTCOEFF          */
#define _MODEM_PREFILTCOEFF_PREFILTCOEFF_MASK                   0xFFFFFFFFUL                                    /**< Bit mask for MODEM_PREFILTCOEFF             */
#define _MODEM_PREFILTCOEFF_PREFILTCOEFF_DEFAULT                0x3B3B3B3BUL                                    /**< Mode DEFAULT for MODEM_PREFILTCOEFF         */
#define MODEM_PREFILTCOEFF_PREFILTCOEFF_DEFAULT                 (_MODEM_PREFILTCOEFF_PREFILTCOEFF_DEFAULT << 0) /**< Shifted mode DEFAULT for MODEM_PREFILTCOEFF */

