SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32BG24/Include/efr32bg24_modem.h
/* Bit fields for MODEM ADPC4 */
#define _MODEM_ADPC4_RESETVALUE                                 0x1F1F1F1FUL                               /**< Default value for MODEM_ADPC4               */
#define _MODEM_ADPC4_MASK                                       0x1F1F1F1FUL                               /**< Mask for MODEM_ADPC4                        */
#define _MODEM_ADPC4_ADBBSSAMPLUT0_SHIFT                        0                                          /**< Shift value for MODEM_ADBBSSAMPLUT0         */
#define _MODEM_ADPC4_ADBBSSAMPLUT0_MASK                         0x1FUL                                     /**< Bit mask for MODEM_ADBBSSAMPLUT0            */
#define _MODEM_ADPC4_ADBBSSAMPLUT0_DEFAULT                      0x0000001FUL                               /**< Mode DEFAULT for MODEM_ADPC4                */
#define MODEM_ADPC4_ADBBSSAMPLUT0_DEFAULT                       (_MODEM_ADPC4_ADBBSSAMPLUT0_DEFAULT << 0)  /**< Shifted mode DEFAULT for MODEM_ADPC4        */
#define _MODEM_ADPC4_ADBBSSAMPLUT1_SHIFT                        8                                          /**< Shift value for MODEM_ADBBSSAMPLUT1         */
#define _MODEM_ADPC4_ADBBSSAMPLUT1_MASK                         0x1F00UL                                   /**< Bit mask for MODEM_ADBBSSAMPLUT1            */
#define _MODEM_ADPC4_ADBBSSAMPLUT1_DEFAULT                      0x0000001FUL                               /**< Mode DEFAULT for MODEM_ADPC4                */
#define MODEM_ADPC4_ADBBSSAMPLUT1_DEFAULT                       (_MODEM_ADPC4_ADBBSSAMPLUT1_DEFAULT << 8)  /**< Shifted mode DEFAULT for MODEM_ADPC4        */
#define _MODEM_ADPC4_ADBBSSAMPLUT2_SHIFT                        16                                         /**< Shift value for MODEM_ADBBSSAMPLUT2         */
#define _MODEM_ADPC4_ADBBSSAMPLUT2_MASK                         0x1F0000UL                                 /**< Bit mask for MODEM_ADBBSSAMPLUT2            */
#define _MODEM_ADPC4_ADBBSSAMPLUT2_DEFAULT                      0x0000001FUL                               /**< Mode DEFAULT for MODEM_ADPC4                */
#define MODEM_ADPC4_ADBBSSAMPLUT2_DEFAULT                       (_MODEM_ADPC4_ADBBSSAMPLUT2_DEFAULT << 16) /**< Shifted mode DEFAULT for MODEM_ADPC4        */
#define _MODEM_ADPC4_ADBBSSAMPLUT3_SHIFT                        24                                         /**< Shift value for MODEM_ADBBSSAMPLUT3         */
#define _MODEM_ADPC4_ADBBSSAMPLUT3_MASK                         0x1F000000UL                               /**< Bit mask for MODEM_ADBBSSAMPLUT3            */
#define _MODEM_ADPC4_ADBBSSAMPLUT3_DEFAULT                      0x0000001FUL                               /**< Mode DEFAULT for MODEM_ADPC4                */
#define MODEM_ADPC4_ADBBSSAMPLUT3_DEFAULT                       (_MODEM_ADPC4_ADBBSSAMPLUT3_DEFAULT << 24) /**< Shifted mode DEFAULT for MODEM_ADPC4        */

/* Bit fields for MODEM ADPC5 */
#define _MODEM_ADPC5_RESETVALUE                                 0x1B1F1F1FUL                               /**< Default value for MODEM_ADPC5               */
#define _MODEM_ADPC5_MASK                                       0x1F1F1F1FUL                               /**< Mask for MODEM_ADPC5                        */
#define _MODEM_ADPC5_ADBBSSAMPLUT4_SHIFT                        0                                          /**< Shift value for MODEM_ADBBSSAMPLUT4         */
#define _MODEM_ADPC5_ADBBSSAMPLUT4_MASK                         0x1FUL                                     /**< Bit mask for MODEM_ADBBSSAMPLUT4            */
#define _MODEM_ADPC5_ADBBSSAMPLUT4_DEFAULT                      0x0000001FUL                               /**< Mode DEFAULT for MODEM_ADPC5                */
#define MODEM_ADPC5_ADBBSSAMPLUT4_DEFAULT                       (_MODEM_ADPC5_ADBBSSAMPLUT4_DEFAULT << 0)  /**< Shifted mode DEFAULT for MODEM_ADPC5        */
#define _MODEM_ADPC5_ADBBSSAMPLUT5_SHIFT                        8                                          /**< Shift value for MODEM_ADBBSSAMPLUT5         */
#define _MODEM_ADPC5_ADBBSSAMPLUT5_MASK                         0x1F00UL                                   /**< Bit mask for MODEM_ADBBSSAMPLUT5            */
#define _MODEM_ADPC5_ADBBSSAMPLUT5_DEFAULT                      0x0000001FUL                               /**< Mode DEFAULT for MODEM_ADPC5                */
#define MODEM_ADPC5_ADBBSSAMPLUT5_DEFAULT                       (_MODEM_ADPC5_ADBBSSAMPLUT5_DEFAULT << 8)  /**< Shifted mode DEFAULT for MODEM_ADPC5        */
#define _MODEM_ADPC5_ADBBSSAMPLUT6_SHIFT                        16                                         /**< Shift value for MODEM_ADBBSSAMPLUT6         */
#define _MODEM_ADPC5_ADBBSSAMPLUT6_MASK                         0x1F0000UL                                 /**< Bit mask for MODEM_ADBBSSAMPLUT6            */
#define _MODEM_ADPC5_ADBBSSAMPLUT6_DEFAULT                      0x0000001FUL                               /**< Mode DEFAULT for MODEM_ADPC5                */
#define MODEM_ADPC5_ADBBSSAMPLUT6_DEFAULT                       (_MODEM_ADPC5_ADBBSSAMPLUT6_DEFAULT << 16) /**< Shifted mode DEFAULT for MODEM_ADPC5        */
#define _MODEM_ADPC5_ADBBSSAMPLUT7_SHIFT                        24                                         /**< Shift value for MODEM_ADBBSSAMPLUT7         */
#define _MODEM_ADPC5_ADBBSSAMPLUT7_MASK                         0x1F000000UL                               /**< Bit mask for MODEM_ADBBSSAMPLUT7            */
#define _MODEM_ADPC5_ADBBSSAMPLUT7_DEFAULT                      0x0000001BUL                               /**< Mode DEFAULT for MODEM_ADPC5                */
#define MODEM_ADPC5_ADBBSSAMPLUT7_DEFAULT                       (_MODEM_ADPC5_ADBBSSAMPLUT7_DEFAULT << 24) /**< Shifted mode DEFAULT for MODEM_ADPC5        */

/* Bit fields for MODEM ADPC6 */
#define _MODEM_ADPC6_RESETVALUE                                 0x11131518UL                                /**< Default value for MODEM_ADPC6               */
#define _MODEM_ADPC6_MASK                                       0x1F1F1F1FUL                                /**< Mask for MODEM_ADPC6                        */
#define _MODEM_ADPC6_ADBBSSAMPLUT8_SHIFT                        0                                           /**< Shift value for MODEM_ADBBSSAMPLUT8         */
#define _MODEM_ADPC6_ADBBSSAMPLUT8_MASK                         0x1FUL                                      /**< Bit mask for MODEM_ADBBSSAMPLUT8            */
#define _MODEM_ADPC6_ADBBSSAMPLUT8_DEFAULT                      0x00000018UL                                /**< Mode DEFAULT for MODEM_ADPC6                */
#define MODEM_ADPC6_ADBBSSAMPLUT8_DEFAULT                       (_MODEM_ADPC6_ADBBSSAMPLUT8_DEFAULT << 0)   /**< Shifted mode DEFAULT for MODEM_ADPC6        */
#define _MODEM_ADPC6_ADBBSSAMPLUT9_SHIFT                        8                                           /**< Shift value for MODEM_ADBBSSAMPLUT9         */
#define _MODEM_ADPC6_ADBBSSAMPLUT9_MASK                         0x1F00UL                                    /**< Bit mask for MODEM_ADBBSSAMPLUT9            */
#define _MODEM_ADPC6_ADBBSSAMPLUT9_DEFAULT                      0x00000015UL                                /**< Mode DEFAULT for MODEM_ADPC6                */
#define MODEM_ADPC6_ADBBSSAMPLUT9_DEFAULT                       (_MODEM_ADPC6_ADBBSSAMPLUT9_DEFAULT << 8)   /**< Shifted mode DEFAULT for MODEM_ADPC6        */
#define _MODEM_ADPC6_ADBBSSAMPLUT10_SHIFT                       16                                          /**< Shift value for MODEM_ADBBSSAMPLUT10        */
#define _MODEM_ADPC6_ADBBSSAMPLUT10_MASK                        0x1F0000UL                                  /**< Bit mask for MODEM_ADBBSSAMPLUT10           */
#define _MODEM_ADPC6_ADBBSSAMPLUT10_DEFAULT                     0x00000013UL                                /**< Mode DEFAULT for MODEM_ADPC6                */
#define MODEM_ADPC6_ADBBSSAMPLUT10_DEFAULT                      (_MODEM_ADPC6_ADBBSSAMPLUT10_DEFAULT << 16) /**< Shifted mode DEFAULT for MODEM_ADPC6        */
#define _MODEM_ADPC6_ADBBSSAMPLUT11_SHIFT                       24                                          /**< Shift value for MODEM_ADBBSSAMPLUT11        */
#define _MODEM_ADPC6_ADBBSSAMPLUT11_MASK                        0x1F000000UL                                /**< Bit mask for MODEM_ADBBSSAMPLUT11           */
#define _MODEM_ADPC6_ADBBSSAMPLUT11_DEFAULT                     0x00000011UL                                /**< Mode DEFAULT for MODEM_ADPC6                */
#define MODEM_ADPC6_ADBBSSAMPLUT11_DEFAULT                      (_MODEM_ADPC6_ADBBSSAMPLUT11_DEFAULT << 24) /**< Shifted mode DEFAULT for MODEM_ADPC6        */

/* Bit fields for MODEM ADPC7 */
#define _MODEM_ADPC7_RESETVALUE                                 0x0C0D0E10UL                                /**< Default value for MODEM_ADPC7               */
#define _MODEM_ADPC7_MASK                                       0x1F1F1F1FUL                                /**< Mask for MODEM_ADPC7                        */
#define _MODEM_ADPC7_ADBBSSAMPLUT12_SHIFT                       0                                           /**< Shift value for MODEM_ADBBSSAMPLUT12        */
#define _MODEM_ADPC7_ADBBSSAMPLUT12_MASK                        0x1FUL                                      /**< Bit mask for MODEM_ADBBSSAMPLUT12           */
#define _MODEM_ADPC7_ADBBSSAMPLUT12_DEFAULT                     0x00000010UL                                /**< Mode DEFAULT for MODEM_ADPC7                */
#define MODEM_ADPC7_ADBBSSAMPLUT12_DEFAULT                      (_MODEM_ADPC7_ADBBSSAMPLUT12_DEFAULT << 0)  /**< Shifted mode DEFAULT for MODEM_ADPC7        */
#define _MODEM_ADPC7_ADBBSSAMPLUT13_SHIFT                       8                                           /**< Shift value for MODEM_ADBBSSAMPLUT13        */
#define _MODEM_ADPC7_ADBBSSAMPLUT13_MASK                        0x1F00UL                                    /**< Bit mask for MODEM_ADBBSSAMPLUT13           */
#define _MODEM_ADPC7_ADBBSSAMPLUT13_DEFAULT                     0x0000000EUL                                /**< Mode DEFAULT for MODEM_ADPC7                */
#define MODEM_ADPC7_ADBBSSAMPLUT13_DEFAULT                      (_MODEM_ADPC7_ADBBSSAMPLUT13_DEFAULT << 8)  /**< Shifted mode DEFAULT for MODEM_ADPC7        */
#define _MODEM_ADPC7_ADBBSSAMPLUT14_SHIFT                       16                                          /**< Shift value for MODEM_ADBBSSAMPLUT14        */
#define _MODEM_ADPC7_ADBBSSAMPLUT14_MASK                        0x1F0000UL                                  /**< Bit mask for MODEM_ADBBSSAMPLUT14           */
#define _MODEM_ADPC7_ADBBSSAMPLUT14_DEFAULT                     0x0000000DUL                                /**< Mode DEFAULT for MODEM_ADPC7                */
#define MODEM_ADPC7_ADBBSSAMPLUT14_DEFAULT                      (_MODEM_ADPC7_ADBBSSAMPLUT14_DEFAULT << 16) /**< Shifted mode DEFAULT for MODEM_ADPC7        */
#define _MODEM_ADPC7_ADBBSSAMPLUT15_SHIFT                       24                                          /**< Shift value for MODEM_ADBBSSAMPLUT15        */
#define _MODEM_ADPC7_ADBBSSAMPLUT15_MASK                        0x1F000000UL                                /**< Bit mask for MODEM_ADBBSSAMPLUT15           */
#define _MODEM_ADPC7_ADBBSSAMPLUT15_DEFAULT                     0x0000000CUL                                /**< Mode DEFAULT for MODEM_ADPC7                */
#define MODEM_ADPC7_ADBBSSAMPLUT15_DEFAULT                      (_MODEM_ADPC7_ADBBSSAMPLUT15_DEFAULT << 24) /**< Shifted mode DEFAULT for MODEM_ADPC7        */

