SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32BG24/Include/efr32bg24_modem.h
/* Bit fields for MODEM ADPC8 */
#define _MODEM_ADPC8_RESETVALUE                                 0x2F87C145UL                                      /**< Default value for MODEM_ADPC8               */
#define _MODEM_ADPC8_MASK                                       0xFFFFFF7FUL                                      /**< Mask for MODEM_ADPC8                        */
#define _MODEM_ADPC8_ADPCOSR_SHIFT                              0                                                 /**< Shift value for MODEM_ADPCOSR               */
#define _MODEM_ADPC8_ADPCOSR_MASK                               0x7UL                                             /**< Bit mask for MODEM_ADPCOSR                  */
#define _MODEM_ADPC8_ADPCOSR_DEFAULT                            0x00000005UL                                      /**< Mode DEFAULT for MODEM_ADPC8                */
#define MODEM_ADPC8_ADPCOSR_DEFAULT                             (_MODEM_ADPC8_ADPCOSR_DEFAULT << 0)               /**< Shifted mode DEFAULT for MODEM_ADPC8        */
#define _MODEM_ADPC8_ADPCANTSAMPOFFSET_SHIFT                    3                                                 /**< Shift value for MODEM_ADPCANTSAMPOFFSET     */
#define _MODEM_ADPC8_ADPCANTSAMPOFFSET_MASK                     0x38UL                                            /**< Bit mask for MODEM_ADPCANTSAMPOFFSET        */
#define _MODEM_ADPC8_ADPCANTSAMPOFFSET_DEFAULT                  0x00000000UL                                      /**< Mode DEFAULT for MODEM_ADPC8                */
#define MODEM_ADPC8_ADPCANTSAMPOFFSET_DEFAULT                   (_MODEM_ADPC8_ADPCANTSAMPOFFSET_DEFAULT << 3)     /**< Shifted mode DEFAULT for MODEM_ADPC8        */
#define MODEM_ADPC8_ADPCANTSAMPSWITCHWAIT                       (0x1UL << 6)                                      /**< ADPCANTSAMPSWITCHWAIT                       */
#define _MODEM_ADPC8_ADPCANTSAMPSWITCHWAIT_SHIFT                6                                                 /**< Shift value for MODEM_ADPCANTSAMPSWITCHWAIT */
#define _MODEM_ADPC8_ADPCANTSAMPSWITCHWAIT_MASK                 0x40UL                                            /**< Bit mask for MODEM_ADPCANTSAMPSWITCHWAIT    */
#define _MODEM_ADPC8_ADPCANTSAMPSWITCHWAIT_DEFAULT              0x00000001UL                                      /**< Mode DEFAULT for MODEM_ADPC8                */
#define MODEM_ADPC8_ADPCANTSAMPSWITCHWAIT_DEFAULT               (_MODEM_ADPC8_ADPCANTSAMPSWITCHWAIT_DEFAULT << 6) /**< Shifted mode DEFAULT for MODEM_ADPC8        */
#define _MODEM_ADPC8_ADPCANTSAMPBUF_SHIFT                       8                                                 /**< Shift value for MODEM_ADPCANTSAMPBUF        */
#define _MODEM_ADPC8_ADPCANTSAMPBUF_MASK                        0x3F00UL                                          /**< Bit mask for MODEM_ADPCANTSAMPBUF           */
#define _MODEM_ADPC8_ADPCANTSAMPBUF_DEFAULT                     0x00000001UL                                      /**< Mode DEFAULT for MODEM_ADPC8                */
#define MODEM_ADPC8_ADPCANTSAMPBUF_DEFAULT                      (_MODEM_ADPC8_ADPCANTSAMPBUF_DEFAULT << 8)        /**< Shifted mode DEFAULT for MODEM_ADPC8        */
#define _MODEM_ADPC8_ADPCANTSAMPWRITE_SHIFT                     14                                                /**< Shift value for MODEM_ADPCANTSAMPWRITE      */
#define _MODEM_ADPC8_ADPCANTSAMPWRITE_MASK                      0x3FC000UL                                        /**< Bit mask for MODEM_ADPCANTSAMPWRITE         */
#define _MODEM_ADPC8_ADPCANTSAMPWRITE_DEFAULT                   0x0000001FUL                                      /**< Mode DEFAULT for MODEM_ADPC8                */
#define MODEM_ADPC8_ADPCANTSAMPWRITE_DEFAULT                    (_MODEM_ADPC8_ADPCANTSAMPWRITE_DEFAULT << 14)     /**< Shifted mode DEFAULT for MODEM_ADPC8        */
#define _MODEM_ADPC8_ADPCANTSAMPSWITCH_SHIFT                    22                                                /**< Shift value for MODEM_ADPCANTSAMPSWITCH     */
#define _MODEM_ADPC8_ADPCANTSAMPSWITCH_MASK                     0xFFC00000UL                                      /**< Bit mask for MODEM_ADPCANTSAMPSWITCH        */
#define _MODEM_ADPC8_ADPCANTSAMPSWITCH_DEFAULT                  0x000000BEUL                                      /**< Mode DEFAULT for MODEM_ADPC8                */
#define MODEM_ADPC8_ADPCANTSAMPSWITCH_DEFAULT                   (_MODEM_ADPC8_ADPCANTSAMPSWITCH_DEFAULT << 22)    /**< Shifted mode DEFAULT for MODEM_ADPC8        */

/* Bit fields for MODEM ADPC9 */
#define _MODEM_ADPC9_RESETVALUE                                 0x00000000UL                                /**< Default value for MODEM_ADPC9               */
#define _MODEM_ADPC9_MASK                                       0x01FFFFFFUL                                /**< Mask for MODEM_ADPC9                        */
#define _MODEM_ADPC9_ADBBSSAMPAVGLIM_SHIFT                      0                                           /**< Shift value for MODEM_ADBBSSAMPAVGLIM       */
#define _MODEM_ADPC9_ADBBSSAMPAVGLIM_MASK                       0xFFUL                                      /**< Bit mask for MODEM_ADBBSSAMPAVGLIM          */
#define _MODEM_ADPC9_ADBBSSAMPAVGLIM_DEFAULT                    0x00000000UL                                /**< Mode DEFAULT for MODEM_ADPC9                */
#define MODEM_ADPC9_ADBBSSAMPAVGLIM_DEFAULT                     (_MODEM_ADPC9_ADBBSSAMPAVGLIM_DEFAULT << 0) /**< Shifted mode DEFAULT for MODEM_ADPC9        */
#define _MODEM_ADPC9_ADBBSSAMPTHR_SHIFT                         8                                           /**< Shift value for MODEM_ADBBSSAMPTHR          */
#define _MODEM_ADPC9_ADBBSSAMPTHR_MASK                          0xFF00UL                                    /**< Bit mask for MODEM_ADBBSSAMPTHR             */
#define _MODEM_ADPC9_ADBBSSAMPTHR_DEFAULT                       0x00000000UL                                /**< Mode DEFAULT for MODEM_ADPC9                */
#define MODEM_ADPC9_ADBBSSAMPTHR_DEFAULT                        (_MODEM_ADPC9_ADBBSSAMPTHR_DEFAULT << 8)    /**< Shifted mode DEFAULT for MODEM_ADPC9        */
#define MODEM_ADPC9_ADBBSSSYNCEN                                (0x1UL << 16)                               /**< Enable sync of BBSS                         */
#define _MODEM_ADPC9_ADBBSSSYNCEN_SHIFT                         16                                          /**< Shift value for MODEM_ADBBSSSYNCEN          */
#define _MODEM_ADPC9_ADBBSSSYNCEN_MASK                          0x10000UL                                   /**< Bit mask for MODEM_ADBBSSSYNCEN             */
#define _MODEM_ADPC9_ADBBSSSYNCEN_DEFAULT                       0x00000000UL                                /**< Mode DEFAULT for MODEM_ADPC9                */
#define _MODEM_ADPC9_ADBBSSSYNCEN_DISABLE                       0x00000000UL                                /**< Mode DISABLE for MODEM_ADPC9                */
#define _MODEM_ADPC9_ADBBSSSYNCEN_ENABLE                        0x00000001UL                                /**< Mode ENABLE for MODEM_ADPC9                 */
#define MODEM_ADPC9_ADBBSSSYNCEN_DEFAULT                        (_MODEM_ADPC9_ADBBSSSYNCEN_DEFAULT << 16)   /**< Shifted mode DEFAULT for MODEM_ADPC9        */
#define MODEM_ADPC9_ADBBSSSYNCEN_DISABLE                        (_MODEM_ADPC9_ADBBSSSYNCEN_DISABLE << 16)   /**< Shifted mode DISABLE for MODEM_ADPC9        */
#define MODEM_ADPC9_ADBBSSSYNCEN_ENABLE                         (_MODEM_ADPC9_ADBBSSSYNCEN_ENABLE << 16)    /**< Shifted mode ENABLE for MODEM_ADPC9         */
#define _MODEM_ADPC9_ADBBSSUPTHR_SHIFT                          17                                          /**< Shift value for MODEM_ADBBSSUPTHR           */
#define _MODEM_ADPC9_ADBBSSUPTHR_MASK                           0x1E0000UL                                  /**< Bit mask for MODEM_ADBBSSUPTHR              */
#define _MODEM_ADPC9_ADBBSSUPTHR_DEFAULT                        0x00000000UL                                /**< Mode DEFAULT for MODEM_ADPC9                */
#define MODEM_ADPC9_ADBBSSUPTHR_DEFAULT                         (_MODEM_ADPC9_ADBBSSUPTHR_DEFAULT << 17)    /**< Shifted mode DEFAULT for MODEM_ADPC9        */
#define _MODEM_ADPC9_ADBBSSDNTHR_SHIFT                          21                                          /**< Shift value for MODEM_ADBBSSDNTHR           */
#define _MODEM_ADPC9_ADBBSSDNTHR_MASK                           0x1E00000UL                                 /**< Bit mask for MODEM_ADBBSSDNTHR              */
#define _MODEM_ADPC9_ADBBSSDNTHR_DEFAULT                        0x00000000UL                                /**< Mode DEFAULT for MODEM_ADPC9                */
#define MODEM_ADPC9_ADBBSSDNTHR_DEFAULT                         (_MODEM_ADPC9_ADBBSSDNTHR_DEFAULT << 21)    /**< Shifted mode DEFAULT for MODEM_ADPC9        */

/* Bit fields for MODEM ADPC10 */
#define _MODEM_ADPC10_RESETVALUE                                0x00000000UL                                 /**< Default value for MODEM_ADPC10              */
#define _MODEM_ADPC10_MASK                                      0x0001FFFFUL                                 /**< Mask for MODEM_ADPC10                       */
#define _MODEM_ADPC10_ADBBSSAMPJUMP_SHIFT                       0                                            /**< Shift value for MODEM_ADBBSSAMPJUMP         */
#define _MODEM_ADPC10_ADBBSSAMPJUMP_MASK                        0xFFUL                                       /**< Bit mask for MODEM_ADBBSSAMPJUMP            */
#define _MODEM_ADPC10_ADBBSSAMPJUMP_DEFAULT                     0x00000000UL                                 /**< Mode DEFAULT for MODEM_ADPC10               */
#define MODEM_ADPC10_ADBBSSAMPJUMP_DEFAULT                      (_MODEM_ADPC10_ADBBSSAMPJUMP_DEFAULT << 0)   /**< Shifted mode DEFAULT for MODEM_ADPC10       */
#define MODEM_ADPC10_ADBBSSCHANGEEN                             (0x1UL << 8)                                 /**< ADBBSSCHANGEEN                              */
#define _MODEM_ADPC10_ADBBSSCHANGEEN_SHIFT                      8                                            /**< Shift value for MODEM_ADBBSSCHANGEEN        */
#define _MODEM_ADPC10_ADBBSSCHANGEEN_MASK                       0x100UL                                      /**< Bit mask for MODEM_ADBBSSCHANGEEN           */
#define _MODEM_ADPC10_ADBBSSCHANGEEN_DEFAULT                    0x00000000UL                                 /**< Mode DEFAULT for MODEM_ADPC10               */
#define _MODEM_ADPC10_ADBBSSCHANGEEN_DISABLE                    0x00000000UL                                 /**< Mode DISABLE for MODEM_ADPC10               */
#define _MODEM_ADPC10_ADBBSSCHANGEEN_ENABLE                     0x00000001UL                                 /**< Mode ENABLE for MODEM_ADPC10                */
#define MODEM_ADPC10_ADBBSSCHANGEEN_DEFAULT                     (_MODEM_ADPC10_ADBBSSCHANGEEN_DEFAULT << 8)  /**< Shifted mode DEFAULT for MODEM_ADPC10       */
#define MODEM_ADPC10_ADBBSSCHANGEEN_DISABLE                     (_MODEM_ADPC10_ADBBSSCHANGEEN_DISABLE << 8)  /**< Shifted mode DISABLE for MODEM_ADPC10       */
#define MODEM_ADPC10_ADBBSSCHANGEEN_ENABLE                      (_MODEM_ADPC10_ADBBSSCHANGEEN_ENABLE << 8)   /**< Shifted mode ENABLE for MODEM_ADPC10        */
#define _MODEM_ADPC10_ADBBSSCHGUPTHR_SHIFT                      9                                            /**< Shift value for MODEM_ADBBSSCHGUPTHR        */
#define _MODEM_ADPC10_ADBBSSCHGUPTHR_MASK                       0x1E00UL                                     /**< Bit mask for MODEM_ADBBSSCHGUPTHR           */
#define _MODEM_ADPC10_ADBBSSCHGUPTHR_DEFAULT                    0x00000000UL                                 /**< Mode DEFAULT for MODEM_ADPC10               */
#define MODEM_ADPC10_ADBBSSCHGUPTHR_DEFAULT                     (_MODEM_ADPC10_ADBBSSCHGUPTHR_DEFAULT << 9)  /**< Shifted mode DEFAULT for MODEM_ADPC10       */
#define _MODEM_ADPC10_ADBBSSCHGDNTHR_SHIFT                      13                                           /**< Shift value for MODEM_ADBBSSCHGDNTHR        */
#define _MODEM_ADPC10_ADBBSSCHGDNTHR_MASK                       0x1E000UL                                    /**< Bit mask for MODEM_ADBBSSCHGDNTHR           */
#define _MODEM_ADPC10_ADBBSSCHGDNTHR_DEFAULT                    0x00000000UL                                 /**< Mode DEFAULT for MODEM_ADPC10               */
#define MODEM_ADPC10_ADBBSSCHGDNTHR_DEFAULT                     (_MODEM_ADPC10_ADBBSSCHGDNTHR_DEFAULT << 13) /**< Shifted mode DEFAULT for MODEM_ADPC10       */

